#include <iostream>
#include <format>
using namespace std;
int main() {

	

	//перменные ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	setlocale(LC_ALL, "russian");
	int sum1 = 0;
	int sum2 = 0;
	int A; //строки первой
	int B; //столбы первой
	int B1;
	int G = 0;
	int F;
	int counter = 0;
	int counter2 = 0;
	int counter3 = 0;



	//ввод размера матриц (массивов) --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	cout << "Размер первой матрицы" << "\n";
	cout << "Количество строк\n";
	cin >> A;
	cout << "Количество столбцов\n";
	cin >> B;
	cout << "\n";
	int B2;
	int** mas = new int* [A]; // инициализирование "двумерного" динамического массива
	for (int i = 0; i < A; i++) { // инициализирование A динамических массивов в "Двумерный" массив B
		mas[i] = new int[B];
	}




	// mas - первая матрица, mas2 - вторая матрица, mas4 - натрица не выход, промежуточный массив для умножения




	int C; // строки второй
	int D; // столбы второй
	cout << "Размер второй матрицы" << "\n";
	cout << "Количество строк\n";
	cin >> C;
	cout << "Количество столбцов\n";
	cin >> D;
	cout << "\n";
	int** mas2 = new int* [C];
	for (int i = 0; i < C; i++) {
		mas2[i] = new int[D];
	}
	int** mas4 = new int* [C];
	int** mas3 = new int* [A];
	for (int i = 0; i < C; i++) {
		mas3[i] = new int[D];
	}
	for (int i = 0; i < A; i++) {
		mas4[i] = new int[D];
	}


	//проверка действия----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	cout << "1-умножение \n2-сумма \n3-вычитание\n4-траспозиция\n5-нахождение детерминанта первой матрицы" << "\n\n";
	while (G != 1) {
		G = 0;

		cin >> F;
		cout << "\n";
		if (F != 1 and F != 2 and F != 3 and F != 4 and F!=5) {
			cout << "Неопределённая функция. Впишите номер той функции, которая дана выше \n";
		}
		else {
			G = 1;
		}
	}

	if (B != C and F==1) {
		cout << "Количество столбцов первой матрицы не соответсвует количеству строк второй, поэтому матрицы нельзя умножить друг на друга";
		counter3 = 1;
	}
	else if (F==3 and A != C or F==3 and B != D) {
		cout << "Обе матрицы должны быть одного размера, чтобы произвести разность матриц";
		counter3 = 1;
	}
	else if (F==2  and A != C or F==2 and B != D) {
		cout << "Обе матрицы должны быть одного размера, чтобы произвести сумму матриц";
		counter3 = 1;
	}
	else if (F == 5 and A != B or A>=4 and B>=4) {
		cout << "Количество строк и линий в первой матрицы должно быть одининаковым для того, чтобы можно было найти детерминант\n(матрица так-же должна быть меньше 4x4";
		counter3 = 1;
	}

	if (counter3 == 1) {
		return 0;
	}

	//ввод1 ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


	cout << "Ввод элементов первой матрицы" << "\n\n";
	for (int i = 0; i < A; i++) {
		for (int j = 0; j < B; j++) {
			cin >> B1;
			mas[i][j] = B1;
		}
	}
	cout << "\n";


	//ввод2 ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

	if (F==1 or F==2 or F==3) {
		cout << "Ввод элементов второй матрицы" << "\n\n";

		for (int i = 0; i < C; i++) {
			for (int j = 0; j < D; j++) {
				cin >> B2;
				mas2[i][j] = B2;
			}
		}
	}
	cout << "\n";
	

	//умножение ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 1) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				counter2++;
				for (int L = 0; L < D; L++) {
					mas3[j][L] = mas[i][j] * mas2[j][L];
					counter++;
				}

			}
			for (int W = 0; W < D; W++) {
				for (int U = 0; U < B; U++) {
					sum1 = sum1 + mas3[U][W];
				}
				mas4[i][W] = sum1;
				sum1 = 0;
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < D; j++) {
				cout << format("{:^8} ",mas4[i][j]);
			}
			cout << ')';
		}
	}



	//сумма --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 2) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				mas4[i][j] = mas[i][j] + mas2[i][j];
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < B; j++) {
				cout << format("{:^8} ", mas4[i][j]);
			}
			cout << ')';
		}
	}



	//разность -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 3) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				mas4[i][j] = mas[i][j] - mas2[i][j];
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < B; j++) {
				cout << format("{:^8} ", mas4[i][j]);
			}
			cout << ')';
		}
	}



	//траспонированние ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

	if (F == 4) {
		for (int i = 0; i < B; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < A; j++) {
				cout << format("{:^8} ", mas[j][i]);
			}
			cout << ')';
		}
	}
	


	//определитель ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


	if (F == 5) {
		if (A == 1) {
			cout << mas[0][0];
		}
		if (A == 2) {
			cout << mas[0][0] * mas[1][1] - mas[1][0] * mas[0][1];
		}
		else if (A == 3) {
			sum1 = ((mas[0][0] * mas[1][1] * mas[2][2]) + (mas[0][1] * mas[2][0] * mas[1][2]) + (mas[0][2] * mas[1][0] * mas[2][1]));
			sum2 =	((-mas[0][2] * mas[1][1] * mas[2][0]) + (-mas[0][0] * mas[1][2] * mas[2][1]) + (-mas[0][1] * mas[1][0] * mas[2][2]));
			cout << sum2 + sum1;
		}
	}
}
