#include <iostream>
#include <format>
using namespace std;
int main() {

	

	//перменные ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	setlocale(LC_ALL, "russian");
	int sum1 = 0;
	int sum2 = 0;
	int A;
	int B;
	int B1;
	int G = 0;
	int F;
	int counter = 0;
	int counter2 = 0;
	int counter3 = 0;



	//ввод размера матриц (массивов) --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	cout << "matrix 1 size" << "\n\n"; 
	cin >> A >> B;	// ввод размеров матрицы
	cout << "\n";
	int B2;
	int** mas = new int* [A]; // инициализирование "двумерного" динамического массива
	for (int i = 0; i < A; i++) { // инициализирование A динамических массивов в "Двумерный" массив B
		mas[i] = new int[B];
	}
	int C;
	int D;
	cout << "matrix 2 size" << "\n\n";
	cin >> C >> D;
	cout << "\n";
	int** mas2 = new int* [C];
	for (int i = 0; i < C; i++) {
		mas2[i] = new int[D];
	}
	int** mas4 = new int* [C];
	int** mas3 = new int* [A];
	for (int i = 0; i < C; i++) {
		mas3[i] = new int[D];
	}
	for (int i = 0; i < A; i++) {
		mas4[i] = new int[D];
	}


	//проверка действия----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	cout << "1-multiplication \n2-addition \n3-substraction\n4-transposition (currently doesnt work)\n5-determinant (works on the first matrix only)(only works with 2x2 and 3x3 matrixes)" << "\n\n";
	while (G != 1) {
		G = 0;

		cin >> F;
		cout << "\n";
		if (F != 1 and F != 2 and F != 3 and F != 4 and F!=5) {
			cout << "incorrect input, follow given instructions above\n";
		}
		else {
			G = 1;
		}
	}

	if (B != C and F==1) {
		cout << "the amount of rows in the first matrix doesn't match the amount of lines in the second matrix, therefore those matrices CANNOT be multiplied";
		counter3 = 1;
	}
	else if (F==3 and A != C or F==3 and B != D) {
		cout << "both of the matrices should be the same size for substruction to work";
		counter3 = 1;
	}
	else if (F==2  and A != C or F==2 and B != D) {
		cout << "both of the matrices should be the same size for sum to work";
		counter3 = 1;
	}
	else if (F == 4 and A != B) {
		cout << "the amount of rows and lines should be equal on the first matrix for transposition to work";
		counter3 = 1;
	}
	else if (F == 5 and A != B or A>=4 and B>=4) {
		cout << "the amount of rows and lines should be equal on the first matrix\nalongside its size being below 4x4 for proccess of calculating determinant to work";
		counter3 = 1;
	}

	if (counter3 == 1) {
		return 0;
	}

	//ввод1 ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


	cout << "matrix 1 input" << "\n\n";
	for (int i = 0; i < A; i++) {
		for (int j = 0; j < B; j++) {
			cin >> B1;
			mas[i][j] = B1;
		}
	}
	cout << "\n";


	//ввод2 ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

	if (F==1 or F==2 or F==3) {
		cout << "matrix 2 input" << "\n\n";

		for (int i = 0; i < C; i++) {
			for (int j = 0; j < D; j++) {
				cin >> B2;
				mas2[i][j] = B2;
			}
		}
	}
	cout << "\n";
	

	//умножение ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 1) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				counter2++;
				for (int L = 0; L < D; L++) {
					mas3[j][L] = mas[i][j] * mas2[j][L];
					counter++;
				}

			}
			for (int W = 0; W < D; W++) {
				for (int U = 0; U < B; U++) {
					sum1 = sum1 + mas3[U][W];
				}
				mas4[i][W] = sum1;
				sum1 = 0;
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < D; j++) {
				cout << format("{:^8} ",mas4[i][j]);
			}
			cout << ')';
		}
	}



	//сумма --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 2) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				mas4[i][j] = mas[i][j] + mas2[i][j];
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < B; j++) {
				cout << format("{:^8} ", mas4[i][j]);
			}
			cout << ')';
		}
	}



	//разность -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 3) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				mas4[i][j] = mas[i][j] - mas2[i][j];
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < B; j++) {
				cout << format("{:^8} ", mas4[i][j]);
			}
			cout << ')';
		}
	}



	//траспонированние ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



	if (F == 4) {
		for (int i = 0; i < A; i++) {
			for (int j = 0; j < B; j++) {
				mas4[i][j] = mas[j][i];
			}
		}
		for (int i = 0; i < A; i++) {
			cout << "\n";
			cout << "(  ";
			for (int j = 0; j < B; j++) {
				cout << format("{:^8} ", mas4[i][j]);
			}
			cout << ')';
		}
	}



	//определитель ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


	if (F == 5) {
		if (A == 1) {
			cout << mas[0][0];
		}
		if (A == 2) {
			cout << mas[0][0] * mas[1][1] - mas[1][0] * mas[0][1];
		}
		else if (A == 3) {
			sum1 = ((mas[0][0] * mas[1][1] * mas[2][2]) + (mas[0][1] * mas[2][0] * mas[1][2]) + (mas[0][2] * mas[1][0] * mas[2][1]));
			sum2 =	((-mas[0][2] * mas[1][1] * mas[2][0]) + (-mas[0][0] * mas[1][2] * mas[2][1]) + (-mas[0][1] * mas[1][0] * mas[2][2]));
			cout << sum2 + sum1;
		}
	}
}
